Revit 2027 API
FormatOptions.CanHaveSymbol Method
Overload List
Name | Description
CanHaveSymbol() |  Checks whether a symbol can be specified to display the unit in this FormatOptions.
CanHaveSymbol(ForgeTypeId) |  Checks whether a symbol can be specified to display a given unit.
Top
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace